{"department": "School of Design", "phone": "312-362-5861", "email": "aturner8@cdm.depaul.edu", "biography": "Allen Turner has been involved in storytelling, game and play design, and education in one way or another for most of his adult life.  \n\nIn the non-profit world he has coordinated youth and adult programs focusing on literacy, storytelling, role-playing activities, and team dynamics as a mechanic for developing inference and problem solving skills.  &lt;br&gt;&lt;br&gt;A student of acclaimed storytellers Shanta and Marcie Telander, Allen has also been active as a storyteller himself.  He was a teller for the Chicago American Indian Center and Native American Studies College in Chicago (where he also provided storytelling workshops) in the early and mid 90s.  He also provided regular cultural performances and presentations for the Chicago Public Schools and Chicago Public Library in addition to performances for the Illinois Teachers Conference, the Newberry Library,  the Chicago Historical Society, and myriad other organizations and institutions.&lt;br&gt;&lt;br&gt;Allen's involvement with the video games industry began at Bungie Software where he started off as Tech Support and eventually grew to help out with the production polish of Myth II.  He later went on to Day 1 Studios where he worked as a level designer for MechAssault on the X-Box.  &lt;br&gt;&lt;br&gt;Most recently Allen was employed at Wideload Games/Disney Interactive Studios where he acted as a Lead Designer and Game Director.  At Wideload he has worked on Stubbs the Zombie: Rebel Without a Pulse, and Hail to the Chimp, Guilty Party, and Avengers Initiative and Marvel XP.  \n\nAllen is not only an active video game designer he also spends much of his time designing tabletop games as well. Most recently he published \"Ehdrigohr: The Roleplaying Game\" which is a dark fantasy horror game that draws inspiration from the folklore indigenous peoples around the world and while at the same time exploring the identity in culture and the processes of struggling against depression.\n\nHe has hopes to bring his years of interacting, entertaining, and educating people to the table in designing games that are engaging and approachable for a wide variety of users."}