{"department": "School of Computing", "phone": "(312) 362-5174", "email": "mobasher@cs.depaul.edu", "biography": "Dr. Bamshad Mobasher is a professor of Computer Science and the director of the Center for Web Intelligence at DePaul University College of Computing and Digital Media in Chicago. He is also the co-founder and the director of the Center for Data Mining and Predictive Analytics at DePaul University. He received his Ph.D. in Computer Science at Iowa State University in 1994. His general research areas include artificial intelligence and data mining. In particular, he is considered one of the leading authorities in Web mining, Web personalization, and recommender systems. He has published 5 edited books, numerous book chapters, and over 150 scientific articles. As the director of the Center for Web Intelligence, he directs research in these areas and regularly works with the industry on various joint projects. He serves in leadership positions of several international conferences, including the ACM Conference on Recommender Systems, ACM SIGKDD Conference on Knowledge Discovery and Data Mining, and the International Conference on User Modeling, Adaptation, and Personalization. He has been an organizer of several long-running and highly regarded workshop series on Web mining and personalization, including the WebKDD series of workshops on Knowledge Discovery on the Web, the Workshop on Intelligent Techniques for Web Personalization,  and the Workshop on Recommender Systems for the Social Web. These workshops have been held regularly at KDD, IJCAI, UMAP, RecSys, and AAAI. Dr. Mobasher serves as an associate editor for the &lt;i&gt;ACM Transactions on the Web&lt;/i&gt;, the &lt;i&gt;ACM Transactions on Internet Technology&lt;/i&gt; and the &lt;i&gt;ACM Transactions on Intelligent Interactive Systems&lt;/i&gt;. He has also served on the editorial boards of several other prominent computing journals, including &lt;i&gt;User Modeling and User-Adapted Interaction&lt;/i&gt;, and the &lt;i&gt;Journal of Web Semantics&lt;/i&gt;. \n\n&lt;p&gt;Visit Dr. Mobasher's research profiles on:\n[&lt;a target=\"_blank\" href=\"http://scholar.google.com/citations?user=VxhX6sAAAAAJ&amp;amp;hl=en&amp;amp;oi=ao\"&gt;&lt;strong&gt;Google Scholar&lt;/strong&gt;&lt;/a&gt;] [&lt;a target=\"_blank\" href=\"\nhttp://academic.research.microsoft.com/Author/1724006/bamshad-mobasher\"&gt;&lt;strong&gt;Microsoft Academic Search&lt;/strong&gt;&lt;/a&gt;] [&lt;a target=\"_blank\" href=\"http://www.informatik.uni-trier.de/~ley/db/indices/a-tree/m/Mobasher:Bamshad.html\"&gt;&lt;strong&gt;DBLP&lt;/strong&gt;&lt;/a&gt;].\n&lt;/p&gt;\n&lt;p&gt;For more information visit &lt;a href=\"http://facweb.cs.depaul.edu/mobasher/\"&gt;Dr. Mobasher's Web Site&lt;/a&gt;.&lt;/p&gt;"}