{"department": "School of Design", "phone": "312-362-5838", "email": "bschrank@cdm.depaul.edu", "biography": "Brian received his BFA in Computer Animation summa cum laude from the Atlanta College of Art in 2003 and became a character animator on \"The Urbz: Sims in the City\" at Electronic Arts. He earned a Masters of Entertainment Technology from Carnegie Mellon University and presented his thesis \"Kotodama: The Power of Words\" at the Game Developers Conference in 2005. He completed his Ph.D. in Digital Media and Videogames at the Georgia Institute of Technology in 2010.\n\nBrian's MIT Press book \"Avant-garde Videogames: Playing with Technoculture\" is due for publication in spring 2014. In 2013 he developed a VR game called \"Dumpy: Going Elephants\" with DePaul students that won 2nd place in the IndieCade VR competition. \"Pedandeck,\" his experimental social card game, was jury selected into the IndieCade Showcase at the Electronic Entertainment Expo in 2013. \"Gentle Carmel: Into the Black Dumb,\" is his graphic novel about a boy hobo who overcomes his disability, was made it into the juried Chicago Alternative Comics Expo and Alternative Press Expo in 2013 and is available in bookstores across Chicago.\n\nBrian has developed AR games and toys for Motorola, Qualcomm and Cartoon Network and helped design NSF-funded physics software to encourage women to seek careers in engineering. He's presented work at the Art History of Games Conference at the High Museum of Art, the International Symposium on Mixed and Augmented Reality, Stanford University, Georgia Tech, The Great Lakes Film Festival, and other venues. He traveled and taught for several years in Mexico, India, Taiwan, Thailand, Cambodia, Laos, Vietnam, Palestine, and Israel.\n\n==========================================================================\nSchrank's creative work, research, and classes may be found on his personal website: &lt;a href=\"http://www.BrianSchrank.com\"&gt;www.BrianSchrank.com&lt;/a&gt;\n=========================================================================="}