{"department": "School of Cinematic Arts", "phone": "312-362-7912", "email": "bzahm@cdm.depaul.edu", "biography": "Brian is an award-winning multidisciplinary artist whose work has been exhibited worldwide at film festivals, screening series, clubs, art galleries and on TV.  Riding the analog-to-digital wave for over twenty years, he works in narrative, documentary and experimental filmmaking, performs and produces electronic music, indulges in photography and graphic design, and enjoys writing “fast-food” fiction.  Having spent much of his career working in the commercial film and media industry, over the past several years his reputation has grown as a prolific outsider artist due to bold and diverse stylistic explorations with such films as Auraprint, Wiggah, Snuff, Milquetoast, Marquee, Tea Party and Le Nu.\n\nNo matter what artistic direction, he strives to create a timeless, unforgettable experience through his work.  To do this, he cross-pollinates concepts and techniques from any number of disciplines and genres, and with the films Vamos, See Wall, Juice and Boombox Parade Party he developed his own style called Fun-D-Mental Filmmaking (Fun=Fun D=Documentary Mental=Experimental).  Inspiring this cinematic form was the documentary feature Headspace: The Sound of Life, for which he was the writer, cinematographer and editor—the film called “visionary” by The New York Times.\n \nHe puts his career in education, and the opportunity to mentor students, above all else.  A true career highlight was the unique opportunity to take his educational and professional production skills to Guyana, South America where he was tasked to help bring a narrative film industry to the country as part of a large grant from Higher Education for Development (H.E.D.) and USAID, this project called The President’s Film Endowment. Over the course of four months, he taught all phases of production to 180 students, ages 18-65, who had little-to-no film experience.  With this newfound knowledge and modest production equipment and resources, the students created eight short narrative films featuring Guyanese culture and formed a film collective known as CineGuyana.  Ultimately these films went all over the world to film festivals and eventually were shown at The American Film Institute in Washington, D.C.   "}