{"department": "College of Computing and Digital Media", "phone": "", "email": "cmuelle2@cdm.depaul.edu", "biography": "Charles Mueller is a native Midwesterner, born in South Bend, Indiana, where he played kid's parts in community theater.\n\nHe was a principal on-camera and voiceover actor, designer and animation apprentice for two seasons of \"Beyond Our Control,\" the satirical, national award-winning TV Show about TV.  BOC was produced at the NBC affiliate at Notre Dame University, WNDU-TV.\n\nCharles played Nugget in, \"Equus,\" at Indiana University theater, and at the Firehouse Theater he played Tom in, \"That Championship Season,\" both in South Bend, Indiana.\n\nAfter college Charles was a copy assistant at WGN-TV, news writer for United Press International, associate editor for, \"down beat,\" (jazz) magazine, wrote fiction about life on the street and news features for the free weekly \"Chicago Reader,\" and for technical publications in the subjects of Chicago theater, aeronautics and architecture history, high-rise period building renovation, the lives of rodeo stars, dressage, fencing, symphony music, toxic waste, and labor relations. \n\nCharles trained in acting in the various methods (Stanislavski, Meisner) at the now long-gone Actor's Center under Kyle Donnelly and Karen Fort, studied character acting at NeXt Theater Co. in Evanston with Steve Pickering and Barbara Harris, and improvisational comedy under Martin DeMaat, Del Close and Don De Pollo at the \"The Second City,\" where Charles worked on the nightclub staff and was known as, \"Chainsaw.\"  \n\nHe was a laborer, production weldor, Congress Hotel bar manager in a blue polyester suit, wrangler at a thoroughbred stable in Barrington, snow-truck driver for the Illinois Department of Transportation, and stage mechanic and carpenter for The Goodman Theater.  \n\nAs Alex in, \"The Point Man,\" Charles appeared at the Stage Two Theater in Waukegan.  In off-Loop theater he appeared as Glider in, \"The Talking Dog,\" at the Center Theater; Orlando, in \"As You Like It,\" at the Talisman Theater; Teddy in, \"Big Maggie,\" at the Irish American Players; Kvorka in, \"The Man With The Golden Arm,\" at the Open City Theater; Micheal in, \"The Acid Knight,\" at The Heartland Project; Stagehand in, \"The Swing,\" and Ross in, \"MacBeth,\" both at the Prop Theater; all in Chicago.  \n\nOn-camera and in voiceovers Charles portrayed characters in industrials for Long John Silver's, McDonald's, Motorola, and Abbott Laboratories, and worked as an actor and stuntman in the Gene Hackman feature film, \"The Package,\" the TV series \"Crime Story,\" with Dennis Farina, and in the short-lived TV series allegedly about the Chicago news trade, \"Jack and Mike.\" \n\nIn Chicago's Uptown neighborhood Charles mentored at-risk young actors at the Chicago Park District's Chase Park Shakespeare Theater, and appeared as the beneficent King of France and various thugs in \"King Lear;\" as the evil Duke Frederick and the confused Oliver Martext in \"As You Like It;\" Elbow and Abhorsen in, \"Measure for Measure;\" Lodovico in, \"Othello;\" Gremio in, \"The Taming of the Shrew;\" and Banquo, in \"MacBeth.\" \n\nCharles has written for the local off-Loop theater, documentary narrations for children's film, direct-response TV commercials and infomercials, and after several years working in film as a production assistant, art department assistant, and camera intern, in 1995 researched and produced \"Stalingrad,\" a rock-historical, travelogue, video documentary shot in Russia and Colorado Springs.\n\nIn commercial film Charles directed hard-sell direct-response TV spots, for products such as the \"HandyLight,\" \"ShowFinder Deluxe,\" \"Caddy Card,\" and \"Sentron Health Scale.\" \n\nIn video and film production, Charles has directed over 50 live performance, 4-camera videos for Chicago’s Old Town School of Folk Music.  He researched images, handled and loaded Panavision 35-mm. film cameras and lenses, and ran child actors and locations for TV Asahi (Locations, \"Hiroshima\"), Manarchy Ltd. (Stylist, \"Primitive Desire: Cadillac\"), City Films (kid-wrangler, \"Sears\"), TriStar Pictures (camera apprentice, \"Rudy,\" directed by David Anspaugh), CBS-TV (camera apprentice, \"Angel Street\"), and Twentieth Century-Fox (camera intern, \"Folks,\" with Don Ameche, Anne Jackson, Tom Selleck).  \n\nHe has booked locations and production teams including as an office and set Production Coordinator, Key Production Assistant, or PA on national spots for Best Light (Sara Lee), Chicago Story (Western Publishing), Crossroads (Sears), Kevin Biles Design (Toyota Dealer Meeting), LensCrafters, (Lynda Carter), Manarchy Ltd. (Chrysler, Wamsutta, Cadillac, Alka-Seltzer, Penney’s, Motorola), Marshall's (Bo Jackson), Planet Video (George Benson), Post Effects (Chevrolet S-10), Richter (Memorial HMO), Tribune Entertainment (Dennis Miller); on network TV in \"Chicago Hope,\" \"Due South,\" \"E.R.\", \"Unsolved Mysteries;\" in the feature films, \"Blankman,\" (Damon Wyans), \"The Fugitive,\" (Harrison Ford), \"Miracle on 34th Street,\" (Elizabeth Perkins, Richard Attenborough); and music videos (\"Jam,\" MJJ Productions Inc. Michael Jackson, Michael Jordan). \n\nAs a non-DGA assistant director, Charles organized shot coverage, prepared locations, and secured releases for over 15 documentaries including, \"Green On Thursdays,\" on Chicago hate-crime (winner, Ann Arbor and Boston Gay and Lesbian Film Festivals), the \"Stalingrad,\" rockumentary, in Colorado Springs, Colorado and Moscow and Volgograd, Federation of Russia, and, \"The Secret Journey,\" a history of the mysteries of the Freemasons.  \n\nHe has directed background, prepared call sheets, sound and camera and production reports, and moved principal actors and extras through hair and makeup as a Director’s Guild of America Assistant Director in features and TV in, \"Light It Up,\" [Fox], \"Chicago Hope,\" [Fox TV], \"Hoodlum,\" [United Artists], \"EZ Streets,\" [CBS], and for commercials (Miller, 7-Eleven, Milwaukee Admirals, Ameritech).  \n\nIn 2008 Charles worked as location Second Assistant Director (background director and atmosphere, extras) on, \"Public Enemies,\" (Johnny Depp, directed by Michael Mann).  \n\nSince 1986 Charles has been a member in good standing of the Screen Actor's Guild.  Charles was made a 2nd Assistant Director in the Director’s Guild of America in 1994, and a Director in 2011.  \n\nIn addition to working towards the MFA in Cinema Directing, and teaching as an adjunct professor of film at DePaul University, Charles is a professional ratings analyst in finance.  \n\nCharles is a devotee of Dickens, Conrad, Salinger, Thomas Pynchon and E. B. White, a guitar-player and acolyte of Gram Parsons, Leo Kottke and Johnny Cash, bicyclist, and tree-hugger.  He is a certified PADI medical emergency first-responder, and CPR and AED-qualified by the American Red Cross.\n\nBOC:\t\thttp://www.beyondourcontrol.org/\nIMDb.com:\thttp://www.imdb.com/name/nm0611020/\nLinkedIn: \t                 http://www.linkedin.com/pub/charles-mueller/13/761/40b/"}