{"department": "College of Computing and Digital Media", "phone": "", "email": "cjois@cdm.depaul.edu", "biography": "CP Jois is the Vice President of Technology Research for ACT. In this role, he has responsibility to work closely with the corporate ventures group and help guide technology investments.  \n\nPrior to this he served as the Senior Vice President and Chief Information Officer for a $1B+ Higher-Ed Corporation in the US. Joining to serve as the Chief Architect, he was promoted to be the Chief Technology Officer leading the Architecture and Product Engineering group, the Software Quality team and their Center for Technology Innovation.\n\nIn his prior roles, Jois has driven the development of transformative educational technologies, most recently as the leader of the team that developed their revolutionary adaptive learning technology.\n\nHe brings in 24 years of technology management experience spanning multiple industry verticals performing various roles in software engineering, program management, and technology strategy &amp; architecture. \n\nJois has broad-based experience in blueprinting, launching and executing technology initiatives. He has a successful track record in acquiring funding for transformation and innovation initiatives.\n\nOver the past decade, he has focused extensively on the Social, Mobile, Analytics and Cloud (SMAC) revolution and has helped corporations with SMAC adoption strategies and readiness initiatives. He has successfully transformed existing portfolios, re-architected products and launched mobility solutions. Jois believes in the potential the Cloud offers beginning with enabling the move of computing power to the Cloud on one end; and the value of adopting plug and play innovation from the Cloud on the other end. He is currently focused on building a framework that leverages the compelling power that is brought about by the convergence of these next-generation technology paradigms.\n\nHis other interests include software economics, enterprise architecture, component-driven product development, integration strategies, IT portfolio governance and information intelligence maturity. He is a Earned Value proponent and has developed a signature methodology to successfully lead large technology programs. \n\nJois is a technology evangelist who passionately pursues the power of innovation for business value, writes regularly on the power of transformational technologies and speaks at various forums. He has spent many years helping organizations deal with challenges around software asset reuse, software quality and portfolio refactoring. \n\nHis career has taken him through organizations such as Unisys, Wipro, United Airlines and Capgemini. He brings in extensive international experience with Fortune 500 organizations, has worked with clients in Banking, Aviation, Higher Ed, Transportation, Hospitality, Insurance, Manufacturing, and has rich experience in globally distributed software delivery.\n"}