{"department": "College of Computing and Digital Media", "phone": "", "email": "dbuchholz@cdm.depaul.edu", "biography": "Dale Buchholz is currently a Member of Technical Staff in the Systems Engineering Group at Scientific Games.  He currently participates in the Gaming Standards Association (GSA) which specifies communication protocol and data format standards for the legalized gaming industry.  He has been inducted into the GSA Circle of Excellence as a result of his record of leadership and contributions.&lt;br&gt;&lt;br&gt;Dale has over 30 years of network industry experience in research and development with Aware Networks, Auvo Technologies, Motorola, AT&amp;T Bell Laboratories, WMS Gaming and now Scientifc Games.  At Auvo, he was Director of Technology for a multi-modal browser product for wireless networks. At Motorola, he was a Senior Member of Technical Staff and Manager of the Application Architecture Lab at Motorola Labs.  He has extensive experience in research and development of end-to-end wireless network architecture, applications and services.  He co-founded the Wireless Application Protocol (WAP) Forum and the IEEE 802.11 Wireless LAN standards committees while at Motorola.  He has also served on the Advisory Committee of the World Wide Web Consortium, as Chairman of the Windows Sockets 2.0 Wireless Functionality Group, as a member of the IEEE 802.9 Integrated Voice and Data standards group, and as a Director of the Multimedia Communication Forum.&lt;br&gt;&lt;br&gt;Dale has been a full-time and part-time professor at DePaul University since 1982.  He teaches courses in data communications, telecommunications and computer architecture at the graduate and undergraduate levels, including data communications, computer networks, computer architecture, telephony, and wireless networks.  His areas of research include IP network protocols, wireless networks, Storage Area Networks (SANs), and embedded system design.&lt;br&gt;&lt;br&gt;Dale holds 35 U.S. patents with several more pending.  He has authored several conference and journal proceedings, as well as a number of written contributions to different standards organizations.  He is a Member of the ACM and IEEE in which has been a Member of the IEEE Communications Society for over 30 years.  He received his B.S. in Electronics Engineering Technology from DeVry Institute of Technology and M.S. in Computer Science from DePaul University.  He also completed all course work towards a Ph.D. in Computer Science at Northwestern University."}