{"department": "College of Computing and Digital Media", "phone": "312-362-6819", "email": "econfer@cdm.depaul.edu", "biography": "In his role as founder and president of Outrageous Innovation Inc., Ellis Confer brings more than 20 years of consulting experience helping people and companies identify and achieve their goals melding re-designed business processes with state-of-the-art technologies. Born of Mr. Confer's expertise designing solutions that address the human-technology interface requirements, Outrageous Innovation strives to create a personalized, online leisure lifestyle concierge service helping online visitors and guests research, plan and transact their entertainment and leisure goals. &lt;br&gt;&lt;br&gt;Mr. Confer has engaged in extensive research and practice development in the following e-commerce topic areas: spiral branding techniques for effective marketing of e-commerce firms, building identity and brand equity, establishing e-commerce business alliances, personalization and one-to-one marketing, loyalty programs, site visitation, the evolution of web portals to web hubs, linking e-commerce to traditional physical distribution and customer service processes, interface design, web site staffing and infrastructure requirements, and online traffic/shopper demographics. &lt;br&gt;&lt;br&gt;Prior to founding Outrageous Innovation, Confer held executive and project management positions with Accenture (formerly Andersen Consulting), culminating as a an Associate Partner, Lead Architect and Project Director for the firm's Technology Architecture and Solution Delivery Group. With a particular focus on e-commerce solution design and development, Confer's major achievements included project management of a $70 million e-business architecture contract for a major health services firm.&lt;br&gt;&lt;br&gt;Mr. Confer served as Professional Services Practice Manager with Sybase, where he developed, sold and managed delivery of distributed, net-centric client/server systems. In this role, Confer won the Sybase Professional Services Achievement Award after successfully penetrating Best 100 insurance clients and Fortune 100 financial service firms, with several multi-million dollar project-based engagement wins. &lt;br&gt;&lt;br&gt;In addition, Mr. Confer served as Manager of Systems Integration Services with IBM, where he managed a consulting unit responsible for sale and delivery of complex systems development and integration consulting services. Confer's performance earned the IBM National Emphasis Award and recognition as one of the top 15 consultants worldwide, for significant contributions and major contract wins. Mr. Confer was a member of the IBM 100 Percent Club for three successive years in his four-year tenure with the firm.&lt;br&gt;&lt;br&gt;Prior to IBM, Mr. Confer has also held consulting management positions with Ernst &amp; Young, Tandem Computers, CNA Financial, and he has established and managed his own information management consulting firm, Confer Consulting, serving clients in electronics manufacturing, financial services, legal services and government. &lt;br&gt;&lt;br&gt;Mr. Confer earned his MBA from Indiana University, and his B.S. in Electrical Engineering from the University of Michigan. He has pursued continuing education in such diverse topics as financial services in cyberspace, E-Commerce and the application of personalization technology, Internet Architecture, security system design and a range of business management functions. &lt;br&gt;&lt;br&gt;He is a member of the Executive Club of Chicago, the Institute of Electrical and Electronics Engineers (IEEE), and the American Society of Industrial Security (ASIS).&lt;br&gt;"}