{"department": "College of Computing and Digital Media", "phone": "", "email": "ggeracie@cdm.depaul.edu", "biography": "Greg Geracie is the President of Actuation Consulting, a global provider of product management training, consulting, and advisory services to some of the world’s most well-known organizations. Actuation Consulting provides popular training courses for product managers as well as product teams.\n\nMr. Geracie is also the author of the global best seller Take Charge Product Management© and the Editor-in-Chief of The Guide to the Product Management and Marketing Body of Knowledge©. This is an industry-wide effort to standardize the practice of product management sponsored by the Association of International Product Management and Marketing (AIPMM). \n\nMr. Geracie earned undergraduate degrees from the University of Vermont and continued his executive education at Harvard, MIT, and the Wharton School. \n\nGreg Geracie is the President of Actuation Consulting, a global provider of product management training, consulting, and advisory services to some of the world’s most well-known organizations. Actuation Consulting provides popular training courses for product managers as well as product teams.\n\nGreg is the author of the global best seller Take Charge Product Management and the Editor-in-Chief of The Guide to the Product Management and Marketing Body of Knowledge (ProdBOK), an industry-wide effort to standardize the practice of product management. He is also an Adjunct Professor at DePaul University’s College of Computing and Digital Media where he teaches graduate and undergraduate courses on high-tech product management. Greg earned his undergraduate degree from the University of Vermont and continued his executive education at Harvard, MIT, and the Wharton School.\n\nGreg is a regular contributor to a wide variety of industry publications. Recent articles have been published by the Silicon Valley Product Management Association, the Boston Product Management Association, the Association of International Product Marketing and Management, the Project Times, asapm, IPMA and the Business Analyst Times. He is also an active contributor to webinars and blogs and speaks frequently on the subject of product management and product team collaboration."}