{"department": "School of Design", "phone": "312-362-1280", "email": "hquinn2@cdm.depaul.edu", "biography": "A Chicago-based Creative Director and Educator, Heather received a BFA with Honors from Rhode Island School of Design in Graphic Design in 1996. She received several awards while at RISD and began her eight-year teaching career there in 2002 as an Adjunct Professor of Graphic Design. Her areas of teaching included Color Theory, Web Design, and Visual Communication.\n\nOriginally from Massachusetts, Heather’s 19 year career began in Boston as a visual designer for Fitch. She also worked for Boston firms Corey McPherson Nash (now Corey) and Weymouth Design with a focus on brand and identity design, package design, and annual reports. In 1999 she began working as a visual designer for Sapient for a variety of Fortune 500 clients across web and application designs. In 2002 Heather founded Brookline Street Design, an award winning, multi-disciplinary design studio whose clients included Harvard, MIT, Health Dialog, the United Nations, Boston Children’s Hospital, the Analysis Group, and Perkin Elmer among others. She also continues to partner with other agencies including SapientNitro, Essential Design, and Blue Metal Architects on a variety of user experience and brand design projects.\n\nHeather’s approach to her work is grounded in business strategy and user experience and is driven by the fundamentals of art and design. As primarily a visual designer and creative strategist, she is often the bridge between the business strategists and information architects and the technology teams and developers. Though Heather works on complex branding and technical projects, she still begins by sketching with pencil and paper.\n\nHeather lives in the Chicago area with her husband and their two daughters.\n\nAreas of Professional Focus and Experience\nCreative direction and user experience design across channels including branding, print, websites, applications, and mobile\n\nAcademic Research/Areas of Interest\nColor theory, nature and natural systems, modern art and design, textile design and patterns, printmaking, letterpress, typography, hand drawn letters, visual trends, vintage books, paper, drawing, sketchbooks, design theory, and process\n\nAwards and Publications\nGraphis Design Annual, 1000 Designer Greetings, Communications Arts, Boston Magazine, The Knot Magazine, The Providence Journal, RI Monthly Magazine, RISD, Gilbert Paper Award, Providence Journal Award for Design Excellence, Wayne Smith Award for Design Excellence, RISD Textile Department Award, Type Director’s Club\n\n\nLinked In \nhttps://www.linkedin.com/pub/heather-quinn/1/53a/63a"}