{"department": "College of Computing and Digital Media", "phone": "", "email": "helmutepp@cdm.depaul.edu", "biography": "Helmut Epp was appointed executive vice president for Academic Affairs in the summer of 2005 and the following spring was named provost of DePaul University. A DePaul faculty member for more than 30 years, as well as an administrator for 27 of those 30 years, Epp has a keen analytical grasp of the complex issues in higher education. He has a passion for DePaul's mission of access and a sincere dedication to the success of an institution he has served for nearly his entire academic career.&lt;br&gt;&lt;br&gt;Epp first demonstrated his capacity for vision and strategy in 1980 as founding chairman of the Department of Computer Science in the College of Liberal Arts and Sciences, which he later developed into a freestanding school (CDM, formerly CTI) that quickly became one of the nations largest schools of computer science. CDMs record enrollments and innovative degree programs were the hallmark of his tenure in CDM, as was his envisioning of Course OnLine, a unique distance learning vehicle. Under his deanship, CDM was first recognized by the federal government as a National Center of Academic Excellence in Information Assurance by the National Security Agency and the U.S. Department of Homeland Security.&lt;br&gt;&lt;br&gt;While leading the College of CDM and its predecessor department for more than 25 years, Epp also served as vice president for Information Services at DePaul from 1996 to 1998. In that role, he was instrumental in developing Web-based systems for online registration, photo-enhanced class rosters, grade entry and electronic pay stubs. His vision set the stage for many later advancements in the universitys network/telecommunications, academic technology development and information technology areas.&lt;br&gt;&lt;br&gt;Under Epps leadership as EVP and provost, DePaul has realized a number of significant achievements including national rankings for the colleges of Law and Commerce, improvements in undergraduate and transfer student advising, enhanced student support services including the creation of DePaul Central, expanded international program opportunities and the formation of a Center for World Catholicism. Epps vision has also resulted in the establishment of the new College of Communication. Additional accomplishments include overseeing academic financial planning, which encompasses more than 80 percent of the universitys annual budgeted resources, and championing initiatives for VISIONtwenty12.&lt;br&gt;&lt;br&gt;An experienced industrial consultant, Epp's research efforts have concentrated on artificial intelligence applications in manufacturing and medicine.&lt;br&gt;&lt;br&gt;He received master of science and doctor of philosophy degrees in mathematics from Northwestern University and was a C.L.E. Moore Instructor at MIT and a member of the mathematics department at the University of Illinois at Chicago before joining the faculty at DePaul.&lt;br&gt;"}