{"department": "College of Computing and Digital Media", "phone": "", "email": "jfoster@cdm.depaul.edu", "biography": "Prior to his retirement, Jim was the Hardware Design Technology and Compliance Certification, Director at Lucent Technologies, in Naperville Illinois.&lt;br&gt;&lt;br&gt;Today, he is a reader of stories, a homework assistant, a maker of pancakes (from scratch), a travel service, a plumber, a carpenter, a painter, a mechanic, a developer of career programs for students, a counselor, an educational consultant, a chef, a housekeeper, a swimming instructor, a home phone answering/messaging service, a tax preparer/payer, a completer of forms, and much, much, more.  He is also the President and CEO of Foster Green Morgan, LLC, and inventor of the EnducationalGameWorks™ Program.&lt;br&gt; &lt;br&gt;Jim earned an Associates Degree in Applied Science from DeVry Technical Institute, a BSEE in Electromagnetics from the University of Illinois at Chicago, and a MSEE in Electromagnetics from Stanford University. &lt;br&gt;&lt;br&gt;Jim has developed and actively participates in a variety of programs directed towards the conscious inclusion and participation of African-Americans in the areas of science and technology.  Also, he has developed and presented numerous workshops directed at strategic career planning and motivating youth to pursue careers.&lt;br&gt;&lt;br&gt;Jim is a former chairperson of the Association of Minority Engineers Student Organization at the University of Illinois at Chicago, and former chairperson of the Chicago Chapter of the National Technical Association (NTA). He was the technical recruiter at the University of Illinois at Chicago for twenty-five years, and a member and past chairperson of the Minority Engineering Programs Advisory Board. He is the former AT&amp;T campus executive at Xavier University in Louisiana, and was elected four times as a member of the Beasley Local School Council (covering a nine-year period) and elected eight of the nine as chairperson of the local school council. He is currently a member of the Museum of Science and Industry’s Black Creativity Advisory Committee and chairperson of the Career Conferences Committee.&lt;br&gt;&lt;br&gt;Jim has received numerous recognition awards for his community activities. Some of which are: the University of Illinois Community Partner Award, the ABLE Business Excellence Award, Lucent’s Affirmative Action Diversity Council Career Service Award, and the Switching Systems Group Gold and Platinum Awards, the 73rd Torchbearer of the UIC Alumni Association Lighting of the Flame, one of the individuals featured in the emerging technologies exhibit of the 2003 Museum of Science and Industry’s CyberRhythms: Black Innovations In Technology exhibit, and a Showcase Program winner in the 2004 Careers Conference.&lt;br&gt;&lt;br&gt;Jim resides with his wife, Sandra, and three children on Chicago's South Side.&lt;br&gt;"}