{"department": "School of Computing", "phone": "312-362-5841", "email": "jspears@cdm.depaul.edu", "biography": "Janine Spears is an Assistant Professor at DePaul University’s School of Computing where she teaches graduate and undergraduate courses in legal issues in information assurance, information security management, system analysis, and organizational modeling.\n\nProfessor Spears’ research focuses on information security risk management and online consumer privacy. Her research has been published in MIS Quarterly, Information &amp; Management, Journal of Information Systems Education, ISACA Journal, and in IEEE and AIS conference proceedings.\n\nShe works on curriculum development of DePaul’s governance, risk management, and compliance (GRC) concentration in the MS-CINS (Masters of Science in Computer Information Network Security) degree program. She founded and serves as the faculty advisor for DePaul’s ISACA (Information Systems Audit and Control Association) student organization.\n\nProfessor Spears holds a PhD from Penn State University's Smeal College of Business, an MBA from Case Western Reserve University’s Weatherhead School of Management, and a B.S. from California State University at Los Angeles. She completed a postdoctoral fellowship at HEC Montreal, a business college in Canada, and has been a visiting professor at Ecole de Management in Strasbourg, France. Her previous industry experience was as a systems analyst in the aerospace and major motion picture studio industries in California, and as a technical account manager in France for a manufacturer of network authentication devices.\n\n&lt;b&gt;Selected publications&lt;/b&gt;:\n1. San Nicolas-Rocca, T., Schooley, B., Spears, J., (2014) “Exploring the Effect of Knowledge Transfer Practices on User Compliance to IS Security Practices,” International Journal of Knowledge Management, vol. 10(2), Apr-Jun. \n&lt;p&gt;2. Spears, J., Erete, S., ““I have nothing to hide; thus nothing to fear”: Defining a Framework for Examining the ‘Nothing to Hide’ Persona,” Workshop on Privacy Personas and Segmentation at the Symposium on Usable Privacy and Security (SOUPS), Jul 2014. \n&lt;p&gt;3. San Nicolas-Rocca, T., Schooley, B., Spears, J., “Designing Effective Knowledge Transfer Practices to Improve IS Security Awareness and Compliance,” the 47th Hawaii International Conference on System Sciences (HICSS), Jan 2014 \n&lt;p&gt;4. Spears, J., Barki, H., Barton, R., (2013) “Theorizing the Concept and Role of Assurance in Information Systems Security,” Information &amp; Management, vol. 50(7), pp. 598-605 (1-year Impact factor 1.788; 5-year Impact factor 3.392)\n&lt;p&gt;5. Spears, J., Parish, J., (2013) “Security Requirements Identification from Conceptual Models in Systems Analysis and Design: the Fun &amp; Fitness, Inc. Case,\" Journal of Information Systems Education, Special Issue: Incorporating Global Information Security and Assurance in I.S. Education, vol. 24(1), pp. 17-30 \n&lt;p&gt;6. Spears, J., “The Effects of Notice versus Awareness: An Empirical Examination of an Online Consumer’s Privacy Risk Treatment,” the 46th Hawaii International Conference on System Sciences (HICSS), 2013 \n&lt;p&gt;7. Spears, J., “Conceptualizing Data Security Threats and Countermeasures in the E-Discovery Process with Misuse Cases,” Americas Conference on Information Systems (AMCIS), 2012 \n&lt;p&gt;8. Spears, J., Barki, H., (2010) “User Participation in IS Security,” MIS Quarterly, vol. 34(3), pp. 503-522 "}