{"department": "College of Computing and Digital Media", "phone": "", "email": "jhopki@artic.edu", "biography": "Jason Hopkins received his BA from Amherst College in Fine Arts and also holds a BFA and MFA from the School of the Art Institute of Chicago. During his academic career he completed several independent animated shorts including 'Chushingura: The Tale of the Loyal Retainers' which earned him 'Best Animated Short' in the 'Five-College Film Festival, and his Master's Thesis 'Peristalsis' which was exhibited at the Gene Siskel Theater in Chicago. In 2006, at The World Animation Fair, he premiered his independent feature, 'Penguin Delinquency,' and in 2008, completed a medical animation entitled 'Implantation: New Frontiers and the Last Barrier to Human Reproduction' with grants obtained from the Rinehart Center for Reproductive Medicine and Organon Pharmaceuticals. The 16-minute, 3D animated film was shown at the 2009, American Society for Reproductive Medicine Video Session. In 2010, he completed another independent short 'The Tigress,' an adaptation from one of the Jataka Tales.&lt;br&gt;&lt;br&gt;Jason has worked at Anzovin Animation Studios in Massachusetts, Noodlesoup Productions in New York City on the 'Venture Brothers' cartoon series, and at Calabash Animation in Chicago on various commercial endeavors. He is an adjunct professor of 2D and 3D animation for broadcast and gaming, in addition to special topics including digital compositing, lighting, rendering, rigging, and dynamics. At Giannini Creative he worked as a CG Animation Artist in their 3D digital division producing work for clients including Nestle, Hershey's, Gillette, and Coca Cola. He was a rigger and lead animator for the Effie award-winning 'Smart' Hotels.com ads featured in the November 2010 issue of 3D World Magazine and, in collaboration with Studio One Digital, was lead rigger and animator for McDonald's 'Happy' Campaign.  He is currently animating for Little Genius Games on a children's educational game.&lt;br&gt;"}