{"department": "School of Cinematic Arts", "phone": "(312) 362-5132", "email": "zielinski@cdm.depaul.edu", "biography": "JoAnne Zielinski is a producer, director and Associate Dean in the School of Cinema and Interactive Media at DePaul.  As a filmmaker, JoAnne was an Associate Producer on the film Flat Chested written and directed by Kristyn Benedyk starring Alicia Witt and Luke Perry.  The feature-length film Sweet Sixteen she produced and co-directed with Gary novak is currently in post-production. \n\nJoAnne produced Vincent de Paul: Charity’s Saint for DePaul University. The film is currently airing on Catholic TV and has been dubbed in French and Spanish and subtitled in Korean.  It premiered at the International Christian Film Festival held in the United Kingdom, the International Film Festival of Ireland, and the Chagrin Falls International Documentary Film Festival.  The film received an “Award of Excellence: feature documentary” from The Accolade Competition and a “Certificate of Merit” from the Chicago International Film Festival and a Telly Award.\n\nJoAnne also produced an eight episode web series for DePaul University, INSIDE twenty12 in collaboration with Orchard Productions.  The series received five Telly Awards for their achievement in documentary filmmaking.  She also worked with the Society of St. Vincent de Paul to create the documentary Poverty in America to raise the visibility of the poor and articulate how the need for increased funding, supportive legislation and networking by political, social, and religious leaders is imperative to address issues of poverty on a local, regional, and national level. \n\nJoAnne was an Associate Producer for the short film, Scott’s Dead, starring Michael Rooker and produced a short documentary The Making of Scott’s Dead, both for Project Bluelight.  Additional producing credits include the short films:  Last Call, William’s Left Ear, and Seven Panel Romance.  \n\nJoAnne served as casting director for the animated short films:  Chicks, Akimbo, Teddy’s Pursuit, and OK Old Kids.  She coordinated casting for the video games: Octodad, Battle Tactic’s and Devil’s Tuning Fork.  \n\nA stage veteran, JoAnne was a founding member of Shakespeare on the Green, an outdoor Shakespeare festival, where she served as Managing, Fundraising, and Marketing Director for A Midsummer Night’s Dream, Twelfth Night, As You Like It, Much Ado About Nothing, Romeo and Juliet, Macbeth, Hamlet, Richard III, King Lear, The Tempest, and Othello.  She was a member of the Barat College faculty for 14 years where she taught acting, voice and directed America Hurrah, Schadenfreude, Raggedy Ann and Andy, Six Degrees of Separation, The Real Inspector Hound, Brecht Unleashed, The madwoman of Chalet, Under Milkwood, Crimes of the Heart, Rimers of Eldrich and Bus Stop.\n\nJoAnne has acted professionally in theatre, film, commercials, and voiceovers, and is a member of AEA, SAG, and AFTRA. She is the recipient of a YMCA Woman of Achievement Award in the Arts for her work on Shakespeare on the Green and the Barat College Board of Trustees Excellence in Teaching Award. "}