{"department": "College of Computing and Digital Media", "phone": "312-362-5621", "email": "jwilso61@cdm.depaul.edu", "biography": "Johnny L. Wilson served on the editorial staff of &lt;i&gt;Computer Gaming World&lt;/i&gt; magazine for over a decade, leaving his post as Editorial Director in 1998 to assume the rank of Group Publisher for the Wizards of the Coast magazines (&lt;i&gt;Amazing Stories, Dragon, Dungeon, Polyhedron, Star Wars Gamer, Star Wars Insider,&lt;/i&gt; and &lt;i&gt;TopDeck&lt;/i&gt;). He has served on the Board of Directors for Turbine Entertainment Software and been the keynote speaker for several major conferences, including the GDC and the Serious Games Summit. He is the co-author of &lt;i&gt;High Score: An Illustrated History of Electronic Games, Rome on 640K a Day or Sid Meiers Civilization&lt;/i&gt; (among others), and &lt;i&gt;The SimCity Planning Commission Handbook&lt;/i&gt; and &lt;i&gt;The SimEarth Bible&lt;/i&gt;, as well as contributor to &lt;i&gt;The Developers Market Guide&lt;/i&gt; and Technical Editor on &lt;i&gt;The Magic of Interactive Entertainment&lt;/i&gt;. &lt;br&gt;Wilson has always attempted to integrate his theological background (Ph.D. and Master of Theology in Old Testament Studies), his interest in history (outside area in History of Rome at University of Kentucky for Ph.D.), and his love of games into challenging designers, gamers, and students to consider ethical, philosophical, and religious dimensions of the hobby. He has consulted on games and written background documents for games, as well as being an outspoken and prolific critic. His theological work includes the article on Games, Gaming for &lt;i&gt;The Mercer Dictionary of the Bible&lt;/i&gt; (among others).&lt;br&gt;Prior to coming to DePaul University, Wilson gave guest lectures at M.I.T., Hastings College (Nebraska), and Georgia Tech, as well as serving on a guest panel for evaluating student projects at DigiPen Institute of Technology and Indiana University. He has taught on the Game Art &amp; Design faculties for the Art Institute of Atlanta and the Illinois Institute of Art in Chicago. He is currently rewriting &lt;i&gt;High Score&lt;/i&gt; and developing an online course on the History of Games for another university.&lt;br&gt;"}