{"department": "School of Cinematic Arts", "phone": "312-362-6792", "email": "jzeiger@cdm.depaul.edu", "biography": "Jonah Zeiger is a producer, director, writer, actor, and programmer who has worked in narrative and documentary film and video as well as in the theatre.  Credits include producing the award-winning short \"The King of URLs\" (\"Best of the Fest\" Judges Prize for Best Short Film and Audience Award for Best Drama, Chicago International Reel Shorts Film Festival; Official Selection, New York Television Festival, ITVFest) and the Student Academy Award- winning short, \"True Confessions of a Sushi Addict,\" a deadpan comedy that was sold for worldwide distribution (Atom/Shockwave) and has been broadcast on 5 continents, including Showtime in the US.  The film won numerous awards and screened at dozens of festivals.  \n\nHis newest film, \"The ART POLICE\" was produced through DePaul's Project Bluelight program. \"The ART POLICE\" garnered a Platinum REMI Award in the Dramatic Original Short Film Category from Worldfest-Houston International Film Festival. The film had its world premiere at the Washington DC Independent Film Festival was also an Official Selection at the Taos Shortz FilmFest, Albany FilmFest (California), Rochester International Film Festival, Indiana Short Film Festival, and Worldfest-Houston.\n\nHe appeared as an actor in 'Dead Battery' which aired internationally as well as on the SciFi Channel.  Zeiger has written,  directed, produced, and edited numerous shorts and promos, including the promo for performance artist Laurie Anderson's 2005 world tour.  Zeiger directed Sam Shepard's play Action at HERE Arts Center in association with Lincoln Center Theater.  He was assistant director to Joseph Chaikin for the New York premiere of Shepard's 'The Late Henry Moss,' which starred Ethan Hawke at The Signature Theatre. Zeiger received his MFA in film production and directing from NYU Graduate Film School and his BA from Hampshire College in Amherst, Massachusetts where he received a Bowman Grant from the Council on International Educational Exchange to study philosophy in India.  He has studied acting and directing with some of the most renowned teachers in New York City (Michael Howard, Susan Batson, Slava Dogatchev) and has been a working observer at New York's famed Actors Studio. \n\nPrior to DePaul, Zeiger taught advanced cinema production and directing actors for the screen in Ithaca College's Department of Cinema, Photography, and Media Arts.  Prior to that, he taught film, video, and documentary production at the Tecnologico de Monterrey in Mexico City.  Prior to that, he served as Project Manager of Performing Arts and Film at MASS MoCA in North Adams, Massachusetts.  Prior to that he assisted and managed the office of actor-director Steve Buscemi for two years.\n\nAt DePaul, Zeiger founded, directed, and produced the CIM Visiting Artists Series from 2008 - 2013 which continues to bring in world-class figures from cinema and entertainment fields for in-depth onstage conversations about making media that matters.  Zeiger personally recruited and interviewed Werner Herzog, Paula Wagner, Tim Robbins, Sister Helen Prejean, Don Mullan, Christine Vachon, and Tom DiCillo for the Series.  Many simulcast segments are availble for viewing on the DePaul VAS YouTube Channel.\n\nCurrent projects include producing a sci-fi romantic comedy feature (\"LOTION ROBOT\") and ongoing work on a  feature-length documentary entitled 'Starring the Extras,' which delves into the hilarious and heartbreaking world of being a professional movie extra in New York City.   The project, which was selected as a work-in-progress by the IFP Film Market in New York, fuses three of his longstanding obsessions: the phenomenon of acting, the artifice of cinema, and the power of documentary.  He is producing both projects with his frequent collaborator, Kimberly Harwood, under the auspice of their partnership, Good Twin Pictures. www.gtpix.com.\n\nZeiger also serves on the board of directors of IFP/Chicago (The Independent Filmmaker Project) where he chairs IFP's Programming Committee and recently launched the IFP Chicago Master Series, a public presentation and mentorship program featuring leading experts in the business aspects of the U.S. film industry.  The mission of The Master Series is entrepreneurial empowerment for filmmakers."}