{"department": "School of Design", "phone": "312-362-5775", "email": "ksalen@cdm.depaul.edu", "biography": "Katie is a Professor in the School of Computing and Digital Media at DePaul University, and former Director of the Center for Transformative Media at Parsons the New School for Design, a research center focused on emerging trends in design and media. She locates her work in the field of game design and serves as the Executive Director of a non-profit called the Institute of Play that is focused on games and learning. Katie led the team that founded Quest to Learn in 2009, a 6-12th grade public school in New York City, and is helping to remix the model in Chicago at a new charter school called ChicagoQuest. Katie is co-author of Rules of Play, a textbook on game design, The Game Design Reader, Quest to Learn: Growing a School for Digital Kids, and editor of The Ecology of Games: Connecting Youth, Games, and Learning, all from MIT Press. She has worked as a game designer for over 10 years and is a former co-editor of The International Journal of Learning and Media. She was an early advocate of the then-hidden world of machinima and continues to be interested in connections between game design, learning, and transformative modes of play.&lt;br&gt;&lt;br&gt;Katie is the PI or co-PI on grants from the Gates foundation, the MacArthur Foundation, the Carnegie Corporation of New York, and Intel, and has been collaborating with David Birchfield and Mina Glenberg-Johnson from Arizona State University on a project focused on embodied play in mixed reality environments. Her non-profit runs an afterschool program focused on immersing middle school youth in game design, technology, and global collaborations via physical and mobile computing expertise, and she once co-designed a karaoke ice cream truck driven by a squirrel. Katie has been involved in the design of slow games, online games, mobile games, and big games in both the commercial and independent games sectors. Katie holds advanced degrees from the University of Texas at Austin and the Rhode Island School of Design.&lt;br&gt;&lt;br&gt;twitter: depaulgames&lt;br&gt;"}