{"department": "School of Computing", "phone": "", "email": "lknight@cdm.depaul.edu", "biography": "Linda V. Knight teaches and conducts research in the area of Information Technology strategy and development.  Editor-in-Chief of the Journal of Information Technology Education, she is also former Associate Editor of the Information Resources Management Journal, as well as Past President and Fellow of the Society for the Advancement of Information Systems, an affiliate of MBAA International. She has served on the Editorial Advisory Board of the Journal of Cases on Information Technology, and as a member of the Information Resources Management Association Executive Council.  A Fellow of the Informing Science Institute, she also served 5 years on MBAA International's Executive Board, including a term as President. An entrepreneur and IT consultant, she has held industry positions in IT management and quality assurance management, and served over seven years as Associate Dean.  During her time as Associate Dean, the college actually gained market share in a declining market.  In addition to a Ph.D. from DePaul University, she holds an MBA and a bachelor's degree in mathematics, both from Dominican University.  Prior to her academic career, Dr. Knight held a series of progressively more responsible positions in IT and IT management.  Dr Knight is a native Chicagoan, a graduate of the Chicago Public School System, and the proud mother of two adult sons, one of them in the IT field (The other failed to see the light and became a physician).&lt;br&gt;&lt;br&gt;&lt;b&gt;Some gifts require no money:&lt;/b&gt;&lt;br&gt;&lt;br&gt;To donate blood or bone marrow:  &lt;a href='http://www.lifesource.org/specialprograms.asp'&gt;www.lifesource.org&lt;/a&gt;&lt;br&gt;&lt;br&gt;To donate your organs:  &lt;a href='http://www.lifegoeson.com/'&gt;www.lifegoeson.com/&lt;/a&gt;&lt;br&gt;&lt;br&gt;To donate your body:  &lt;a href='http://www.agaillinois.org/donate.htm'&gt;www.agaillinois.org/donate.htm/&lt;/a&gt;&lt;br&gt;&lt;br&gt;To volunteer your time:  &lt;a href=\"http://www.volunteermatch.org/\"&gt; http://www.volunteermatch.org/&lt;/a&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;a href=\"http://lifetimesofwisdom.blogspot.com/\"&gt;Click here to link to Linda Knight's blog&lt;/a&gt;&lt;br&gt;&lt;br&gt;"}