{"department": "School of Cinematic Arts", "phone": "312-362-5982", "email": "lbarcy@cdm.depaul.edu", "biography": "EDUCATION&lt;br&gt;School of the Art Institute of Chicago – Bachelor of Fine Arts, 1991&lt;br&gt;&lt;br&gt;Columbia College Chicago – Master of Arts in Interdisciplinary Arts, 2003&lt;br&gt;&lt;br&gt;TEACHING&lt;br&gt;School of the Art Institute of Chicago, 1999- present&lt;br&gt;Adjunct Assistant Professor, Department of Film, Video and New Media&lt;br&gt;&lt;br&gt;Columbia College Chicago 1997 – present&lt;br&gt;Film Department - Animation Concentration&lt;br&gt;&lt;br&gt;INDEPENDENT WORK AND EXHIBITIONS&lt;br&gt;The Guilt Trip, or The Vaticans Take a Holiday -2004&lt;br&gt;Stop-motion animation, filmed on 16mm and mastered onto DigiBeta. 14 minutes – 2004&lt;br&gt;Selected Screenings: 2004 – The Gene Siskel Film Center - Chicago, The Chicago Underground Film Festival&lt;br&gt;2005 – Slamdance Film Festival - Park City Utah, The Black Maria Film Festival - Jersey City NJ, MadCat Women’s Film Festival - San Francisco CA, Ohio Independent Film Festival - Cincinnati OH, The Director’s Forum, Berlin Germany, Boston Underground Film Festival, Brooklyn Underground Film Festival, The American Cinemateque at the Egyptian Theatre, Los Angeles, 2006.&lt;br&gt;Awards: Best Animated Film - Chicago Underground Film Festival&lt;br&gt;               Juror’s Choice – Black Maria Film Festival&lt;br&gt;               Best Animated Film – Ohio Independent Film Festival&lt;br&gt;&lt;br&gt;The Ordovicians - 2004&lt;br&gt;Collaborative film made with Jim Trainor&lt;br&gt;16mm film 5 minutes – 2004&lt;br&gt;Screenings: 2004 - The Gene Siskel Film Center- Chicago, CinemaTexas – Austin TX,  &lt;br&gt;2005 -New York Underground Film Festival – NY, NY, Movieside Film Festival – Chicago IL, &lt;br&gt;20,000 Leagues Under the Industry Film Festival –Cleveland OH, Rooftop Film Festival - Brooklyn NY.&lt;br&gt;&lt;br&gt;Woman Without a Past - 2003&lt;br&gt;Mixed-media animation shot on 16mm and mastered onto mini DV&lt;br&gt;4.5 minutes, 2003&lt;br&gt;Screenings: 2004 - The Gene Siskel Film Center – Chicago, The Hideout – Chicago, 2005 - Madcat Women’s Film Festival, San Francisco, CA, THe Ice Factory, Chicago, 2006.&lt;br&gt;&lt;br&gt;Mermaid - 2003&lt;br&gt;Performance piece incorporating projected animation and live puppetry&lt;br&gt;2003 – 45 minutes&lt;br&gt;Performances: Columbia College Chicago’s Mayfest, The Rhinoceros Theater Festival at the Chicago Cultural Center, Cucaracha Cabaret, Chicago.&lt;br&gt;&lt;br&gt;Mermaid – (film ) - 2007&lt;br&gt;2-dimensional multi-plane stop-motion and sand animation. 17 minutes&lt;br&gt;&lt;br&gt;&lt;br&gt;RELATED PROFESSIONAL EXPERIENCE AND CHICAGO-BASED CLIENTS&lt;br&gt;&lt;br&gt;Redmoon Theater-  &lt;br&gt;&lt;br&gt;Galways Shadow, 2001 – Designed and created 2-dimensional puppets for a perfomance projected in the windows of The Museum of Contemporary Art in Chicago.&lt;br&gt;Salao, the Worst Kind of Unlucky, 2002 - Designed and created puppets for theatrical production at Chicago Shakespeare Theater.  Received Joseph Jefferson Citation (JEFF Award) for Puppet Design.&lt;br&gt;Winter Pageant, 2003 - Created scratch-animated (cameraless animation) for projection during performance.&lt;br&gt;The Cabinet, 2005 – Designed and created puppets for adaptation of The Cabinet of Dr. Caligari.&lt;br&gt;&lt;br&gt;The Seldoms Dance and Performance Company- &lt;br&gt;&lt;br&gt;Little Roy and the Weird Sisters, 2004 - Created stop-motion animation utilized in site specific performances, performed at Architectural Artifacts, a multi-level warehouse.&lt;br&gt;Giant Fix, 2005 - Created mixed media abstract animation for dance performed at Chicago’s Hamlin Park, in an outdoor empty pool.&lt;br&gt;&lt;br&gt;Blair Thomas and Company-&lt;br&gt;&lt;br&gt;Buster Keaton’s Stroll, 2003 - Designed and built puppets for staged adaptation of work by Federico Garcia Lorca.&lt;br&gt;"}