{"department": "College of Computing and Digital Media", "phone": "773-325-3731", "email": "ldarrow@cdm.depaul.edu", "biography": "The French screenwriter and director Lorraine Darrow came to the United States eight years ago for an English-language film project under the supervision of the noted filmmaking Wachowski brothers. \nShe is now teaching screenwriting at DePaul University and is regularly invited by the animation department of the Maryland Institute College of Art (MICA) as a guest speaker and consultant for senior students since 2010.\nThis spring she has applied for a MFA in screenwriting at DePaul University starting next September.  She is currently writing a novel for a young audience and she is preparing an animation short film project. \n\n\tIn France, she wrote and directed her own films, animated shorts, and documentaries.  All her films were awarded at international film festivals and were distributed broadly. Her award winning feature film Passages was broadcasted in Europe through Arte. Her short animation film Little Sisters was selected at the Cannes Film Festival and won Best Short Film at the International London Film Festival. Portrait of Josette with a Hat won best short film at the International Chicago Children’s Film Festival. \nAfter a Bachelor degree in Law at Panthéon-Assas University (Paris 2), she worked in the French film industry for more than twenty years, handling numerous roles including producer’s assistant, production manager, casting director, and, most importantly first assistant director.  \n\n\tHer teaching experiences started in 1996 at the European Foundation for Cinema in Paris  (La Femis), where she followed up the making of the first year students’ short films. \nShe has been a script reader for the French National Center for Cinema (CNC) and for Emergence (Summer University for Movies) for more than 10 years and she is still reading screenplays for Emergence on regular basis. \nConcurrently, Lorraine regularly works as a translator (novels, graphic novels, and documents) for different French and American publishers and companies. \n\n\t \n"}