{"department": "College of Computing and Digital Media", "phone": "312-362-5740", "email": "mchou@cdm.depaul.edu", "biography": "Teaching Experience:&lt;br&gt; * Faculty at College of Computing and Digital Media (CDM) in DePaul University since 2000.  &lt;br&gt; * Associate Director of the Cloud Computing Programs and Database Programs of Institute for Professional Development (IPD).  &lt;br&gt;&lt;br&gt;Education:&lt;br&gt; * Master of Computer Science from Northwestern University in 1980&lt;br&gt; * Bachelor of Commerce in Business Mathematics from Soochow University, Taiwan in 1976. &lt;br&gt;&lt;br&gt;Professional Synopsis:&lt;br&gt; * More than 25 years of strong IT infrastructure experience along with database administration, data governance, and information management skills in project planning, developing strategies, creating roadmaps, consulting and project management.   &lt;br&gt; * Led the effort coordinating cross functional teams responsible for planning and implementing various business-critical enterprise applications.  &lt;br&gt; * Extended experience in supporting leading Database Management Systems and products. \t &lt;br&gt; * Proven success in compliance practice to minimize risk, reduce corporate liability, lower costs, and increase operational efficiency.&lt;br&gt;&lt;br&gt;Technical Skills:&lt;br&gt;New Technology: Cloud Computing, Big Data, Hadoop, NoSQL, Social Media&lt;br&gt;Data Governance: Compliance, Records Management, Litigation Support, e-Discovery &lt;br&gt; Information Management: Data Archive, Storage Management, Document Management, E-mail &lt;br&gt; Database Administration: Oracle, SQL Server, Database High Availability, Disaster Recovery&lt;br&gt; Infrastructure: Server/Storage/Database Consolidation, Virtualization, Capacity Planning, Process Improvement, Application Sunset, Hardware/Software Decommission&lt;br&gt;&lt;br&gt;Certifications:&lt;br&gt;Cloudera Certified Administrator for Apache Hadoop&lt;br&gt; MongoDB Certified Administrator, Microsoft Certified Trainer (MCT), Microsoft Certified Database Administrator (MCDBA), Microsoft Certified Systems Engineer (MCSE)&lt;br&gt; Oracle DBA certifications (OCA, OCP) &lt;br&gt; Kroll e-Discovery &lt;br&gt; Project Management&lt;br&gt;                                                     &lt;br&gt;http://www.linkedin.com/in/marcochou&lt;br&gt;"}