{"department": "College of Computing and Digital Media", "phone": "", "email": "mgoetsch@cdm.depaul.edu", "biography": "Mark is a leading expert in the areas of enterprise, software, and business architecture. He has worked in entrepreneurial start-ups, mid-market companies, and large International corporations. A former executive for a software solutions provider Mark has worked at all levels from hand-on development to hands-off management. His primary industries include banking, insurance, and manufacturing.\n&lt;P&gt;\nMark started his career in the financial markets as a CBOT floor trader and FOREX dealer.  He worked in both front-office and back-office areas. He transitioned into software development and mainstream finance working with CAPM models, Cost-of-Capital calculations, and doing research into Tobin's Q. He later used this experience in developing risk engines for trading firms.\n&lt;P&gt;\nMark was the co-founder of the Center for the Advocacy of the Enterprise Architecture Profession, a former President of the Business Architects Association, a contributor to the International Association of Software Architects, and a founding member of the World-Wide Institute of Software Architects, where he also served on the board. He was a speaker at SDWest in Silicon Valley, Enterprise Architect's Summit in Palm Springs, CampIT in Rosemont, and Midwest Software Engineering Conference in Chicago. Mark was also a staff writer on UML and Software Architecture for DevX.com.\n&lt;P&gt;\nMark's research interests included PhD work in Social Network Analysis, sitting in on Noshir Contractors PhD seminar, and attending PhD conferences at Northwestern, Harvard, and ETH in Zurich. His current research interests include the use of modularity [and its use in real options] in business and enterprise architecture based on the work of Kim Clark (Colgate University, formally Dean of Harvard's business school) and Carliss Baldwin (Harvard). Mark has an MSC in Systems Strategy and Management from Northwestern University and a MS in Distributed Systems from DePaul University. \n\n\n"}