{"department": "College of Computing and Digital Media", "phone": "773-484-8405", "email": "msandy@cdm.depaul.edu", "biography": "Accomplished project manager with over 13 years hands-on experience in Business Continuity with business and mission critical application systems, mainframes, distributed systems, PCs, telecommunications and networks.  Managing Consultant for Comdisco/SunGard, managing over 30 Business Continuity/Disaster Recovery projects.  These projects included but were not limited to:  Documented recovery plans; Completed over 25 Business Impact Analyses (BIAs); Managed recovery tests; Created project methodologies; Completed a LAN Criticality Analysis; etc.  Was also Director of Business Continuity for a large market research firm.  Responsibilities included, but were not limited to:  Documented multiple disaster recovery and workarea recovery plans; Successfully managed multiple disaster recovery tests at a vendor's warm site that encompassed LANs, Email, Unix systems, mainframe, proprietary hardware and software, Network, Security (Firewall) Internet access, and voice telecom; Increased Corporate awareness regarding Business Continuity; Created RFP and selected warm site vendor for disaster recovery; Conducted disaster recovery and work area recovery tabletop tests for a variety of recovery plans; etc.  Sr. Consultant at Gartner Group, documenting a recovery guidebook for the Business Recovery Director for a Mexican Bank as well as creating methodologies for auditing disaster recovery and work area recovery plans.  Completed an audit of over 38 work area recovery plans for a large Fortune-50 financial services firm.  Also worked on Pandemic Planning and created a unique approach to manual tabletop exercises by automating the process from start to finish.  Achieved a reputation for effectively analyzing the appropriateness of implementing new and existing technologies in a variety of distributed environments for companies in a variety of industries. Recommended the most appropriate Business Continuity solutions, while maintaining excellent client relationships. Currently is an independent consultant, working in in all areas of Business Recovery.  BA and MBA in Information Systems at DePaul."}