{"department": "College of Computing and Digital Media", "phone": "", "email": "mluallen@cdm.depaul.edu", "biography": "Matt Luallen is a well-respected professional with a unique background encompassing several facets of information assurance and content delivery systems surrounding business logic. Mr. Luallen also serves as the President and Principal Consultant of Sph3r3, LLC. Prior to incorporating Sph3r3, Mr. Luallen provided strategic guidance for Argonne National Laboratory, U.S. Department of Energy, within the Information Architecture and Cyber Security Program Office. He has extensive consulting experience within the governmental and commercial sectors including a multi-client base of corporations, financial institutions and healthcare organizations.&lt;&lt;br&gt;&lt;br&gt;A graduate of National Technological University with a Master's Degree in Computer Science, Mr. Luallen holds a Bachelor of Science degree in Industrial Engineering from the University of Illinois, Urbana. This unique coupling has provided an underlying framework to directly correlate core business functions and requirements with computer architectural solutions.&lt;br&gt;&lt;br&gt;Mr. Luallen also is an instructor for DePaul University, the SANS Institute, Global Knowledge and has been asked to speak at many national conventions such as RSA, NetSec, and InfoSec.  He continues to advance his instructional leadership in the areas of digital infrastructure architecture, security policy implementation, intrusion prevention, digital forensics analysis and system sanitization, business continuity and disaster recovery planning, formalized information assurance policy, and secure web transactional architecture.&lt;br&gt;&lt;br&gt;Over the past few years Mr. Luallen has served in an advisory or consulting capacity on information architecture as well as security and computer crime with several U.S. government agencies, commercial entities and their contractors, including the National Science Foundation, FBI InfraGard Program and the National Institute of Standards and Technology. Mr. Luallen also serves on the CompTIA Security+ cornerstone committee and as a member of the Council of General Advisors at the Gerson Lehrman Group.&lt;br&gt;"}