{"department": "College of Computing and Digital Media", "phone": "", "email": "mkestian@cdm.depaul.edu", "biography": "Matt Kestian has over 19 years of Business and Technology experience. Kestian\njoined BlueMetal (The Modern Application Company) in March 2012 as General Manager founding the Chicago office which expanded BlueMetal’s presence into the Chicagoland market from Boston and New York.   Prior to joining BlueMetal, Kestian spent 12 years working for Microsoft Corporation and 5 years with State Farm Insurance Company.\n\nIn his final role with Microsoft, Matt was the United States Competitive Lead. During his tenure, he put in place systems to quickly gain insights, set competitive strategy and drive execution of marketing and sales for Microsoft’s $20 billion U.S. business.\n\nMatt joined Microsoft in January 2000 as a Consultant, helped launch the Chicago Microsoft Technology Center (MTC) in 2001 and was responsible for the technical and operational design of the MTC as well as holding the role of both Sr. Consultant and Sr. Security Specialist. Matt was responsible for driving the Security Practice for the National MTCs.  His concentration was on developing and performing architecture design sessions and strategy briefings focused on the people, processes, and technology aspects of security and operational efficiency.  His roles in the MTC gave him exposure to hundreds of customers operations and security frameworks each year.&lt;br&gt;In 2003, Matt joined the National Security Team as a Strategic Security Advisor in Chicago assigned to the top 25% of accounts. \n\nAs an SSA, Matt was responsible for promoting risk management strategies and best security practices to manage business risks within Microsoft's  enterprise customers. &lt;br&gt;&lt;br&gt;His involvement included:&lt;br&gt;&lt;br&gt;Advising on risk management practices&lt;br&gt;Assisting with the policies, procedures and guidelines for the IT security&lt;br&gt;Technical direction and strategy as well as articulating Microsoft’s security and working with Microsoft’s Security and Business Technology Unit in Redmond&lt;br&gt;Security Account planning to align the customers security strategy and planning with Microsoft’s initiatives&lt;br&gt;Acting as an advocate in the area of security on behalf of the accounts&lt;br&gt;Publicly speaking on security topics&lt;br&gt; \n\nMatt was an active participant on the United States Secret Service, Chicago Electronic Crimes Task Force (2000-2004) and the Information Systems Security Association (ISSA).&lt;br&gt;\n\nMatt has been an adjunct professor at both Illinois State University and DePaul University. \nMatt received his M.S. in Applied Computer Science from Illinois State University (ISU) and a B.S. in Economics from ISU.\n\n Matt was a member of the:\n• Board of Directors for Para Los Ninos\n• Technical Advisory Board for Multi-Factor Authentication, Inc.\n• Served on the Executive Board of Directors for the L.A. Chamber of Commerce\n• Deans Advisory Council at Cal State University Long Beach"}