{"department": "College of Computing and Digital Media", "phone": "773-332-3731", "email": "mflore70@cdm.depaul.edu", "biography": "Michael X. Flores attended the University of Southern California, where he received a Master of Fine Arts in Cinema-Television Production. While studying at USC, Michael was awarded several scholarships including the John Frankenheimer Directing Scholarship for merit in directing and the National Hispanic Foundation for the Arts Entertainment Scholarship. He was also selected to participate as a fellow in Film Independent’s Project:Involve, in which he was personally mentored by Jeffrey Blitz: director of the Academy-Award-nominated documentary -Spellbound (2002). He edited the Student-Emmy-winning TV pilot, “Cost of Living” and wrote and directed an award-winning short film called Esperando (Waiting/Hoping). After graduating from USC, Michael worked as an assistant editor on Tamra Davis’s documentary Jean-Michel Basquiat: The Radiant Child (2010), which premiered at the Sundance Film Festival; on Lisa Leeman’s documentary One Lucky Elephant (2010), which premiered at the Los Angeles Film Festival; and on Bess Kargman’s documentary First Position (2011), which premiered at the Toronto International Film Festival. He then edited Nick Broomfield’s documentary Sarah Palin: You Betcha! (2011), which premiered at the Toronto International Film Festival; Terri Hanauer’s narrative feature Sweet Talk (2012); Lisa and Laura Wilson’s documentary Last Will. &amp; Testament(2012), which was executive produced by Roland Emmerich; and Kimberly Bautista’s documentary Justice for My Sister (2012), which won Best Documentary at the Los Angeles Latino International Film Festival. He also worked on Tommy O'Haver's music video for Matthew Dear; on Eddie Alcazar’s documentary Tapia (2013), which premiered at the Los Angeles Film Festival; and on Neil Berkeley’s documentary Harmontown (2014), which premiered at South By Southwest."}