{"department": "College of Computing and Digital Media", "phone": "", "email": "ppetrov1@cdm.depaul.edu", "biography": "Plamen Petrov is currently employed with Deloitte Consulting LLP as the group CTO for the Cognitive Analytics group within Deloitte Consulting Innovation. Cognitive Analytics is at the multi-disciplinary intersection of Cognitive Computing, Artificial Intelligence, Analytics, Big Data and Cloud Computing. In his role as CTO for the Cognitive Analytics group Plamen Petrov is responsible to define and execute on the technology strategy through a combination of product development, strategic partnerships and technology acquisitions. Prior to joining Deloitte Plamen Petrov was for over 11 years the Chief Enterprise Architect at Blue Cross Blue Shield Association (BCBSA) in Chicago establishing and leading all the architecture practices of the company: Enterprise, Software, Data and Infrastructure architectures, as well leading the Technology Innovation and Knowledge Management area. As a software practitioner, Plamen has held software engineering, software architecture and software research positions in various industries and companies like the Institute for Technical Cybernetics and Robotics, Convergys, Motorola, Sun Microsystems, United Airlines, and Blue Cross Blue Shield Association. Plamen holds a Ph.D. in Computer Science from the University of Illinois at Chicago, doing research in Software Architecture under Dr. Ugo Buy and Artificial Intelligence (AI) under Dr. Peter Nelson. Plamen holds a Master of Engineering Management (MEM) degree in Operations Analysis and Management and Kellogg Executive Scholar in Marketing, Finance, Operations and Management from Northwestern University, Master of Science (MS) degree in Computer Science from Loyola University Chicago, and a joint BS/MS degree in Electrical and Computer Engineering from Technical University of Sofia. Plamen's interests include software architecture, enterprise architecture, artificial intelligence, knowledge representation and knowledge management, heuristic search algorithms, machine learning, high availability (HA) computing and HA clustering, software engineering methodology, software quality."}