{"department": "College of Computing and Digital Media", "phone": "", "email": "rkolagan@cdm.depaul.edu", "biography": "Rajiv Kolagani has over 10 years of experience in the US Healthcare industry and served in a variety of executive and consultative roles at large healthcare providers and payers. Mr. Kolagani is a healthcare futurist who is dedicated to finding innovative solutions that focus on patient health and help clinicians deliver the highest quality care.\n\nMr. Kolagani currently serves as a Strategic Advisor to VC’s, Healthcare Technology companies, Providers, Payers, serving as a trusted consultant to many Healthcare Executives.  In his current role, he creates strategies for large-scale data integration, integrity, mobile transformation, and analytics technology solutions that support integrated care transformation initiatives for healthcare organizations around the United States. Prior to that, Mr. Kolagani served as Vice President of Technology at DaVita Healthcare Partners, Inc.  At DaVita, Mr. Kolagani managed the development of an award winning healthcare technology platform that managed patients with complex financial, clinical (ESRD, Diabetes, Hypertension, CHF etc…) and social needs.  While at DaVita, Mr. Kolagani also spearheaded the modernization of legacy clinical technology platforms by implementing population health analytics, ACO strategy, dual eligible patient management, as well as payer and provider integration strategies.\n\nPrior to his position at DaVita, Mr. Kolagani acted as Vice President of Information Technology Project Services at Healthport Technologies.  During his tenure, he led several Information Technology initiatives related to HIPAA, Healthcare Document Management, EHR Integration, Revenue Cycle Management, IT security, and IT PMO.\n\nMr. Kolagani earned an MBA from Duke University, Fuqua School of Business with a concentration in Health Sector Management.  He is also a Certified Six Sigma Black Belt (CSSBB) and a Certified Professional in Health Information Management Systems (CPHIMS)."}