{"department": "College of Computing and Digital Media", "phone": "312-362-8222", "email": "rkoziel@cdm.depaul.edu", "biography": "Ron is an innovative Wireless Networking Professional who loves to teach and strives to make learning natural and fun. His industry/teaching background includes wireless communications, switching, transmission, and computer data networks including security concepts. Ron is experienced with leading edge educational methods: accelerated learning, virtual and augmented reality, multi-media, video, and distance teaching tools. He earned U.S. Patents for portable education and training systems. A technical contributor to GWEC educational projects funded through NSF.&lt;br&gt;&lt;br&gt;&lt;br&gt;He is currently serving as a consulting Faculty Member to the Computer, Telecommunications and Information Sciences Department at DePaul University now (CDM), where he teaches Wireless and Networking classes and is developing a new Wireless Focus for the Department. Rons Advanced Wireless Course covers 4G, LTE and WiMax based concepts. His teaching history since 2001 is attached.&lt;br&gt;&lt;br&gt;Ron also taught in the University of Wisconsin Engineering Professional Development Program, as an adjunct Computer Science and Telecom Faculty Member at the College of DuPage and in DeVry Universitys live and on line programs. &lt;br&gt; &lt;br&gt;He retired from Bell Labs, where he led the development of UMTS &amp; 3G Wireless Systems Training for the R&amp;D Community.  He is an educational and technical consultant to the Global Wireless Education Consortium that strives to improve wireless education. His corporate experiences include research and development for Motorola, systems engineering, sales and marketing for AT&amp;T and technology consulting for Toshiba America.&lt;br&gt;&lt;br&gt;He earned a B.S.E.E. from the University of Illinois, a M.B.A. with a major in Computer Applications from Loyola University and completed advanced professional education at AT&amp;T/Lucent. Rons advanced research resulted in patents. Ron served four years as Regional Program Director for Business and Engineering at the University of Illinois, where he developed and supported numerous professional improvement programs and teaching technologies. &lt;br&gt;"}