{"department": "School of Cinematic Arts", "phone": "312-656-6098", "email": "serlinder@cim.depaul.edu", "biography": "Scott was originally a fine artist, graduating from Shimer College in 1978 with a BA in liberal arts. After college, he used his graphics and technical skills in the Silicon Valley of California, working on a variety of industrial projects in the electronics field.&lt;br&gt;&lt;br&gt;Returning to Chicago in the late 80's, he continued to work in graphic arts and photography. The natural extension of photography brought him to film making- particularly cinematography- and he entered Columbia College Graduate Program in Film, graduating with his MFA in 1995.&lt;br&gt;&lt;br&gt;He has worked on numerous films, music video's, corporate and documentary projects over the years and produced a PBS documentary 'Storm Warriors' in 2004.&lt;br&gt;&lt;br&gt;Technical Experience:&lt;br&gt;Freelance Director of Photography - 20yrs. &lt;br&gt;In depth knowledge of 35mm/16mm film, standard definition video and high definition video.&lt;br&gt;Specializing in remote camera operation and time-lapse photography in addition to live action work. &lt;br&gt;(See partial credits list below)&lt;br&gt;Expertise in non-linear editing, as well as the compositing program After Effects.&lt;br&gt;&lt;br&gt;&lt;br&gt;Northwestern University (1996- June 2003)&lt;br&gt;Senior Lecturer, in the Radio/TV/Film Department, specializing in production. Teaching Sophomore, &lt;br&gt;Junior, Senior and Graduate level classes in film and video production from pre-production through post- &lt;br&gt;production. (Includes on-line editing and film finishing).&lt;br&gt;&lt;br&gt;AUGUST 2003&lt;br&gt;&lt;br&gt;DePaul University,Chicago&lt;br&gt;Assitant professor in the new new Digital Cinema program&lt;br&gt;&lt;br&gt;&lt;br&gt;Additional Teaching Credits:&lt;br&gt;Instructor for the Santa Fe High Definition Workshops, May 2001, June 2002&lt;br&gt;Instructor for High Definition Video Seminar Golden Dome Prod/Notre Dame Univ., September 2000&lt;br&gt;Instructor at International Film and Television Workshops, Rockport, Maine: &lt;br&gt;High Definition Television Seminar and Advanced Video Production-June 1998 and August 1998&lt;br&gt;Advanced Lighting and Advanced Video Camera-June/August 1999, Advanced Lighting-Aug 2000&lt;br&gt;&lt;br&gt;Education:&lt;br&gt;Columbia College, Chicago, IL - MFA in Film (1996)&lt;br&gt;Shimer College, Mt. Carroll, IL - BA, Major in Fine Arts/Art History (1978)&lt;br&gt;&lt;br&gt;&lt;br&gt;Additional Professional Credits /Publications:&lt;br&gt;July 2002 to present Equipment/Technical staff writer for Screen Magazine &lt;br&gt;September 2002 to present Advisory board member of the Independent Feature Project &lt;br&gt;July 2000 Guest Speaker/Moderator for High Definition Video Conference held by Independent Feature &lt;br&gt;Project and American Society of Cinematographers &lt;br&gt;&lt;br&gt;&lt;br&gt;Projects /Awards:&lt;br&gt;1) The Grosse Point Light, Landmark To Great Lakes History. Twenty-minute interpretive film. August 2001 &lt;br&gt;Superior Achievement award from the Illinois Association of Museums&lt;br&gt;Top honor from the American Association for State and Local History&lt;br&gt;&lt;br&gt;(Writer/Producer/Editor/Director of Photography)&lt;br&gt;&lt;br&gt;&lt;br&gt;2) Storm Warriors: Heroes of the Shipwreck Coast. &lt;br&gt;Shot primarily in High Definition video format, it is a 1 hour program that explores the history of  the United States Lifesaving Service along the Great Lakes : June2004&lt;br&gt;Airing on PBS starting December , 2004&lt;br&gt;(Writer/Producer/Editor/Director of Photography) &lt;br&gt;&lt;br&gt;&lt;br&gt;Partial List of Director of Photography credits: &lt;br&gt;&lt;br&gt;March 2002 Revolving Orbit - Film funded by FMC Corporation concerning the work of African American sculptor Richard Hunt&lt;br&gt;May 2000/2001 Do The Write Thing Chicago Challenge - Promotional videos for local chapter of Stop Violence campaign 2000 and 2001 (also producer and editor)&lt;br&gt;Sept- Feb 1998 Damon Wayans Show - Chicago Unit &lt;br&gt;July 1998 Post Mortem - Short Film Estrada/Link Productions - 'E-films' award winner&lt;br&gt;Sept-Nov 1997 I Do - Cuz Films-Feature &lt;br&gt;Aug/Sept 1997 Windows - Short Film, Awarded best in Cinematography, Toledo, Spain, film festival&lt;br&gt;Sept 1997 Girlfriends - ISS Productions, Feature&lt;br&gt;Jun- Jan 1996-97 The Straight Dope - Series for A&amp;E Network (13 episodes) &lt;br&gt;June/July 1995 Wreck of the Edmund Fitzgerald - National Geographic/Discovery Channel, Documentary&lt;br&gt;May 1995 You Can't Stop Rock 'n Roll - Evergreen Broadcasting, National Clio Award Winner &lt;br&gt;Aug 1995 Maggie’s Attic - Painted Wings Productions, Short Film, Winner of Chicago Film Festival, Silver in Cinematography&lt;br&gt;Jan 1994 Twenty Bucks - Big Tomorrow Productions, Feature Film, 2nd Unit Director of Photography&lt;br&gt;Segment/Corporate Clients: Motorola, National Steel, Golf Construction, Sears, Ameritech, Kodak, Whirlpool, Arthur Andersen, Ohio Arts, MSNBC, ABC, CBS, Kraft, United Airlines, Square D (Schneider Electric), FMC"}