{"department": "College of Computing and Digital Media", "phone": "", "email": "selmours@cdm.depaul.edu", "biography": "Suzanne EL-Moursi is an Digital Strategist and Innovation thought leader who specializes in the design of compelling multi-channel user experiences by first applying dynamic design research methodologies that investigate the unique social and cultural aspects of end user segments. Through her unique approach to ?gaining insight and greater intelligence? about how people live, work and play, she drives innovative products and service offerings that fulfill the aspirations and unmet needs of identified, new customer segments. Her passion lies within planning and executing design research initiatives, which reveal insights into customer behavior, aspirations, unarticulated needs and expectations that inform the Brand?s global Design strategy. Suzanne focuses on translating cultural and social research insights, from design &amp; innovation-centered research and customer segmentation data, into distinctive competitive advantages for product and service offerings. &lt;br&gt;&lt;br&gt;Suzanne holds a Master's degree in User Experience Design &amp; Human-Computer Interaction. Her graduate research was on designing multilingual experiences and interactive digital interfaces for users who speak a non-Latin language and English. Since that time, Suzanne has worked for a variety of international corporations, including IBM Global Services, HSBC Bank, and University of Chicago, on a variety of international projects. She has led multiple international user experience and ethnography efforts in Africa, Middle East, and Europe in Arabic and English.&lt;br&gt;&lt;br&gt;Recently, Suzanne held the position of Principal leading the Interaction Design team, within the Global Design organization at GE Healthcare. As Principal Suzanne is transforming and advancing the next generation of healthcare business strategies and healthcare products through understanding customer insight to design and innovate for unmet user needs in mature and emerging markets. Currently, she is an Associate Creative Director with SapientNitro.&lt;br&gt;"}