{"department": "College of Computing and Digital Media", "phone": "773-325-3731", "email": "zmirza@cdm.depaul.edu", "biography": "Zoaib Mirza is currently the Director of Academic Technology at DeVry Education Group. where he assess, implement, deliver, manage and promote best practices in content delivery models, instructional design and development, and educational and interactive/multimedia technology for DeVry Education Group. clients mainly  Advanced Academics, American University of the Caribbean School of Medicine, Becker Professional Education, Carrington College, Carrington College California, Chamberlain College of Nursing, DeVry Brasil, DeVry University, Ross University School of Medicine and Ross University School of Veterinary Medicine. Prior, he worked as a Director of Online for the Adler School of Professional Psychology, and earlier had various technical and administrative positions at DePaul University.\n\nAs a faculty and facilitator, Mr. Mirza has taught and developed various courses in Technology, Education and Management in K12, undergraduate and graduate schools both, locally and internationally. \n\nAs a philanthropist, he is the founder of a small nonprofit organization called Promote Education. His organization funds and support small educational institutes, especially in developing communities in Pakistan, who seek for educational and financial assistance. He also conducts professional development workshops and seminars for schools and organizations on topics in education, ethics and technology. \n\nHis efforts as an educationalist have been recognized both locally and internationally. He is the recipient of the Best Effective Practice by SLOAN-C, and received The Diversity Scholarship by the Adult Higher Education Alliance. Pakistani media channels, Hum TV and ARY Digital have appreciated his contributions and interviewed him on their morning shows.  He also been interviewed by an internet-based channel in Gurnee, IL called AyanTV. \n\nMr. Mirza completed his MA in Applied Professionals Studies, MS in Applied Technologies and MS in Information Systems from DePaul University, Chicago, Illinois. He completed his Bachelors of Science, Computing, with Honors from Staffordshire University in the United Kingdom.\n\nMr. Mirza currently resides in Des Plaines, IL with his wife and daughter. He enjoys spending his free time with his family, watching movies, and having sumptuous meals."}